@MeharwadeDivya 

The fix does not seem to work for every resource type.
I still get the problem with oci_logging_log resources (here it was a load balancer log), which even forces the recreation of the resource

```
  # oci_logging_log.gdb_lb_app1_log_error must be replaced
-/+ resource "oci_logging_log" "gdb_lb_app1_log_error" {
      ~ compartment_id     = "ocid1.compartment.oc1..aaaaaaaabj3m2vxrw2nacxkqedu5qlnixrpccbiorcbvrjj3c3hkzagco6ca" -> (known after apply)
      ~ defined_tags       = {
          - "Oracle-Tags.CreatedBy" = "default/terraform" -> null
          - "Oracle-Tags.CreatedOn" = "2023-05-04T17:19:35.521Z" -> null
            # (2 unchanged elements hidden)
        }
      ~ freeform_tags      = {} -> (known after apply)
      ~ id                 = "ocid1.log.oc1.eu-amsterdam-1.amaaaaaa6vb5evqaojuepfu33ejbjf6jsfjaqigwuc4fykrhy72hvtt26urq" -> (known after apply)
      ~ state              = "ACTIVE" -> (known after apply)
      ~ tenancy_id         = "ocid1.tenancy.oc1..aaaaaaaamhfxbaorxo2e3svfbspzggsc3n27dm4bosqsxjcwzqbguwidqdhq" -> (known after apply)
      ~ time_created       = "2023-05-04 17:19:35.823 +0000 UTC" -> (known after apply)
      ~ time_last_modified = "2023-05-04 17:19:35.823 +0000 UTC" -> (known after apply)
        # (5 unchanged attributes hidden)
```

while my provider config has:

```
provider "oci" {
  tenancy_ocid     = var.tenancy_ocid
  user_ocid        = var.user_ocid
  fingerprint      = var.fingerprint
  private_key_path = var.private_key_path
  region           = var.target_region
  ignore_defined_tags = ["Oracle-Tags.CreatedBy", "Oracle-Tags.CreatedOn"]
}
```

version

```
Terraform v1.4.6
on linux_amd64
+ provider registry.terraform.io/hashicorp/random v3.5.1
+ provider registry.terraform.io/oracle/oci v4.119.0
```



gist with the debug log: https://gist.github.com/dhoogfr/ceaa2fc7088f02c4306a9fcf469f9cf8